# Словник студентів - виконав Сердюк Максим
students = {
    21: {
        "name": "Сердюк Максим Олександрович",
        "group": "КН-43/1",
        "course": 2,
        "subjects": {
            "Алгоритми і структура даних": 87,
            "Антикорупція та доброчесність": 94,
            "Програмування": 81
        }
    },
    22: {
        "name": "Бардакова Надія Володимирівна",
        "group": "КН-43/1",
        "course": 2,
        "subjects": {
            "Алгоритми і структура даних": 89,
            "Антикорупція та доброчесність": 90,
            "Програмування": 84
        }
    },
    23: {
        "name": "Колдомасов Максим Вікторович",
        "group": "КН-43/1",
        "course": 2,
        "subjects": {
            "Алгоритми і структура даних": 85,
            "Антикорупція та доброчесність": 97,
            "Програмування": 88
        }
    },
    24: {
        "name": "Помощнікова Наталія Андріївна",
        "group": "КН-43/1",
        "course": 2,
        "subjects": {
            "Алгоритми і структура даних": 86,
            "Антикорупція та доброчесність": 89,
            "Програмування": 90
        }
    },
    25: {
        "name": "Трапезніков Максим Валерійович",
        "group": "КН-43/2",
        "course": 1,
        "subjects": {
            "Алгоритми і структура даних": 88,
            "Антикорупція та доброчесність": 90,
            "Програмування": 85
        }
    },
}

def show_all(data):

    if not data:
        print("Словник порожній.")
    else:
        print("\nСловника студентів")
        for student_id, info in data.items():
            print(f"\nID студента: {student_id}")
            print(f"ПІБ: {info['name']}")
            print(f"Група: {info['group']}")
            print(f"Курс: {info['course']}")
            print("Предмети та оцінки:")
            for subject, grade in info['subjects'].items():
                print(f"   {subject}: {grade}")

show_all(students)
